# RemovingUndividedDPartParents Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DPartFailures..::..RemovingUndividedDPartParents Property
BuiltInFailures..::..DPartFailures Class See Also
---
These parts are not intersected by any dividing references. They will be removed from the division.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RemovingUndividedDPartParents { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RemovingUndividedDPartParents As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RemovingUndividedDPartParents {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DPartFailures Class
Autodesk.Revit.DB Namespace